Revit 2027 API
MEPBuildingConstruction.SetBuildingConstructionOverride Method
Sets the Building Construction override for a ConstructionType.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetBuildingConstructionOverride(
	ConstructionType constructionType,
	bool override
)
Public Sub SetBuildingConstructionOverride (
	constructionType As ConstructionType,
	override As Boolean
)
public:
void SetBuildingConstructionOverride(
	ConstructionType constructionType,
	bool override
)
member SetBuildingConstructionOverride :
        constructionType : ConstructionType *
        override : bool -> unit
Parameters
constructionType ConstructionType
The ConstructionType to override.
override Boolean
True to use analytical construction properties specified in Constructions.xml in the given ConstructionType, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The ConstructionType is invalid.
See Also
Reference
MEPBuildingConstruction Class
Autodesk.Revit.DB.Mechanical Namespace